#ifndef S11N_IMPL_SIGNATURE_H
#define S11N_IMPL_SIGNATURE_H

#include "impl/signature_3_serial_tuple.h"

//=======================================================================================
//      signature -- сигнатура типа, что-то вроде отпечатка пальца.
//
//  Сигнатурой считается имя типа + необязательное описание + его отображение на кортеж.
//
//  - имя типа -- см. name_of_type;
//  - описание -- см. description;
//  - отображение на кортеж -- см. tuple_helper;
//
//
//  Сигнатура арифметических типов совпадает с их name_of_type.
//
//  Сигнатура кортежей составляется из фигурных скобок, в которых указываются типы:
//      "{name_of_type1,name_of_type2,...,name_of_typeN}"
//
//
//  Под капотом: сделано в три стадии: <имя_типа> -> <описание> -> <кортеж>
//
//=======================================================================================
namespace s11n {
namespace impl
{
    //===================================================================================
    template <typename T>
    std::string signature();
    //===================================================================================
    template <typename T> constexpr
    crc_type crc();
    //===================================================================================
}}
//=======================================================================================



//=======================================================================================
//      Implementation
//=======================================================================================
namespace s11n {
namespace impl
{
    //===================================================================================
    //      Result wrap
    //===================================================================================
    template <typename T>
    std::string signature()
    {
        return signature_3<T>();
    }
    //-----------------------------------------------------------------------------------
    template <typename T>
    constexpr crc_type calc_crc_T( crc_type prev )
    {
        return calc_crc_3<T>( prev );
    }
    //-----------------------------------------------------------------------------------
    template <typename T>
    constexpr crc_type crc()
    {
        return crc_last_xor ^ calc_crc_T<T>( crc_first_val );
    }
    //===================================================================================
    //      Result wrap
    //===================================================================================
} // namespace impl
} // namespace s11n
//=======================================================================================

#endif // S11N_IMPL_SIGNATURE_H
