#pragma once

//=======================================================================================
//  Какие-то старые компиляторы дурят с типом void_t, добавлено для совместимости.
//
//  Реализация #ifndef, по-моему, кривая. Если сообразите как сделать грамотную проверку,
//  буду сильно признателен.
//=======================================================================================

#include <type_traits>


//=======================================================================================
#ifndef void_t
    namespace std
    {
        template< class... >
        using void_t = void;
    }
#endif
//=======================================================================================
